k6/results/mixed-100k.txt
     checks.........................: 100.00% 322190 out of 322190
     dropped_iterations.............: 7813    260.409057/s
   ✓ http_req_duration..............: avg=13.71ms  med=2.52ms  p(95)=60.03ms p(99)=228.04ms max=704.61ms
   ✓ http_req_failed................: 0.00%   0 out of 322190
     http_reqs......................: 322190  10738.66557/s
     vus_max........................: 1783    min=800              max=1783