k6/results/mixed-10m-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/mixed.js
        output: -

     scenarios: (100.00%) 3 scenarios, 5000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)
              * write: 1000.00 iterations/s for 30s (maxVUs: 200-1000, exec: write, gracefulStop: 30s)


running (0m00.9s), 1015/1528 VUs, 6306 complete and 0 interrupted iterations
rank    [   3% ] 0492/0665 VUs  00.9s/30s  5000.00 iters/s
top     [   3% ] 0491/0663 VUs  00.9s/30s  5000.00 iters/s
write   [   3% ] 0032/0200 VUs  00.9s/30s  1000.00 iters/s

running (0m01.9s), 1581/1944 VUs, 14749 complete and 0 interrupted iterations
rank    [   6% ] 0673/0871 VUs  01.9s/30s  5000.00 iters/s
top     [   6% ] 0734/0869 VUs  01.9s/30s  5000.00 iters/s
write   [   6% ] 0172/0204 VUs  01.9s/30s  1000.00 iters/s

running (0m02.9s), 1282/2186 VUs, 25009 complete and 0 interrupted iterations
rank    [  10% ] 0643/0986 VUs  02.9s/30s  5000.00 iters/s
top     [  10% ] 0640/0985 VUs  02.9s/30s  5000.00 iters/s
write   [  10% ] 0002/0215 VUs  02.9s/30s  1000.00 iters/s

running (0m03.9s), 0295/2255 VUs, 36707 complete and 0 interrupted iterations
rank    [  13% ] 0130/1021 VUs  03.9s/30s  5000.00 iters/s
top     [  13% ] 0130/1019 VUs  03.9s/30s  5000.00 iters/s
write   [  13% ] 0042/0215 VUs  03.9s/30s  1000.00 iters/s

running (0m04.9s), 0040/2255 VUs, 47965 complete and 0 interrupted iterations
rank    [  16% ] 0019/1021 VUs  04.9s/30s  5000.00 iters/s
top     [  16% ] 0018/1019 VUs  04.9s/30s  5000.00 iters/s
write   [  16% ] 0004/0215 VUs  04.9s/30s  1000.00 iters/s

running (0m05.9s), 0064/2255 VUs, 58943 complete and 0 interrupted iterations
rank    [  20% ] 0035/1021 VUs  05.9s/30s  5000.00 iters/s
top     [  20% ] 0021/1019 VUs  05.9s/30s  5000.00 iters/s
write   [  20% ] 0007/0215 VUs  05.9s/30s  1000.00 iters/s

running (0m06.9s), 0067/2255 VUs, 69936 complete and 0 interrupted iterations
rank    [  23% ] 0030/1021 VUs  06.9s/30s  5000.00 iters/s
top     [  23% ] 0030/1019 VUs  06.9s/30s  5000.00 iters/s
write   [  23% ] 0007/0215 VUs  06.9s/30s  1000.00 iters/s

running (0m07.9s), 0185/2255 VUs, 80819 complete and 0 interrupted iterations
rank    [  26% ] 0078/1021 VUs  07.9s/30s  5000.00 iters/s
top     [  26% ] 0074/1019 VUs  07.9s/30s  5000.00 iters/s
write   [  26% ] 0034/0215 VUs  07.9s/30s  1000.00 iters/s

running (0m08.9s), 0030/2255 VUs, 91972 complete and 0 interrupted iterations
rank    [  30% ] 0016/1021 VUs  08.9s/30s  5000.00 iters/s
top     [  30% ] 0011/1019 VUs  08.9s/30s  5000.00 iters/s
write   [  30% ] 0003/0215 VUs  08.9s/30s  1000.00 iters/s

running (0m09.9s), 0049/2255 VUs, 102972 complete and 0 interrupted iterations
rank    [  33% ] 0020/1021 VUs  09.9s/30s  5000.00 iters/s
top     [  33% ] 0025/1019 VUs  09.9s/30s  5000.00 iters/s
write   [  33% ] 0004/0215 VUs  09.9s/30s  1000.00 iters/s

running (0m10.9s), 0022/2255 VUs, 113982 complete and 0 interrupted iterations
rank    [  36% ] 0012/1021 VUs  10.9s/30s  5000.00 iters/s
top     [  36% ] 0010/1019 VUs  10.9s/30s  5000.00 iters/s
write   [  36% ] 0001/0215 VUs  10.9s/30s  1000.00 iters/s

running (0m11.9s), 0184/2255 VUs, 124816 complete and 0 interrupted iterations
rank    [  40% ] 0083/1021 VUs  11.9s/30s  5000.00 iters/s
top     [  40% ] 0082/1019 VUs  11.9s/30s  5000.00 iters/s
write   [  40% ] 0031/0215 VUs  11.9s/30s  1000.00 iters/s

running (0m12.9s), 0037/2255 VUs, 135960 complete and 0 interrupted iterations
rank    [  43% ] 0015/1021 VUs  12.9s/30s  5000.00 iters/s
top     [  43% ] 0016/1019 VUs  12.9s/30s  5000.00 iters/s
write   [  43% ] 0006/0215 VUs  12.9s/30s  1000.00 iters/s

running (0m13.9s), 0080/2255 VUs, 146925 complete and 0 interrupted iterations
rank    [  46% ] 0036/1021 VUs  13.9s/30s  5000.00 iters/s
top     [  46% ] 0037/1019 VUs  13.9s/30s  5000.00 iters/s
write   [  46% ] 0007/0215 VUs  13.9s/30s  1000.00 iters/s

running (0m14.9s), 0374/2255 VUs, 157577 complete and 0 interrupted iterations
rank    [  50% ] 0183/1021 VUs  14.9s/30s  5000.00 iters/s
top     [  50% ] 0158/1019 VUs  14.9s/30s  5000.00 iters/s
write   [  50% ] 0035/0215 VUs  14.9s/30s  1000.00 iters/s

running (0m15.9s), 0023/2255 VUs, 168979 complete and 0 interrupted iterations
rank    [  53% ] 0008/1021 VUs  15.9s/30s  5000.00 iters/s
top     [  53% ] 0012/1019 VUs  15.9s/30s  5000.00 iters/s
write   [  53% ] 0003/0215 VUs  15.9s/30s  1000.00 iters/s

running (0m16.9s), 0043/2255 VUs, 179962 complete and 0 interrupted iterations
rank    [  56% ] 0020/1021 VUs  16.9s/30s  5000.00 iters/s
top     [  56% ] 0020/1019 VUs  16.9s/30s  5000.00 iters/s
write   [  56% ] 0003/0215 VUs  16.9s/30s  1000.00 iters/s

running (0m17.9s), 0020/2255 VUs, 190979 complete and 0 interrupted iterations
rank    [  60% ] 0009/1021 VUs  17.9s/30s  5000.00 iters/s
top     [  60% ] 0009/1019 VUs  17.9s/30s  5000.00 iters/s
write   [  60% ] 0002/0215 VUs  17.9s/30s  1000.00 iters/s

running (0m18.9s), 0089/2255 VUs, 201912 complete and 0 interrupted iterations
rank    [  63% ] 0040/1021 VUs  18.9s/30s  5000.00 iters/s
top     [  63% ] 0040/1019 VUs  18.9s/30s  5000.00 iters/s
write   [  63% ] 0009/0215 VUs  18.9s/30s  1000.00 iters/s

running (0m19.9s), 0041/2255 VUs, 212968 complete and 0 interrupted iterations
rank    [  66% ] 0022/1021 VUs  19.9s/30s  5000.00 iters/s
top     [  66% ] 0015/1019 VUs  19.9s/30s  5000.00 iters/s
write   [  66% ] 0005/0215 VUs  19.9s/30s  1000.00 iters/s

running (0m20.9s), 0171/2297 VUs, 223785 complete and 0 interrupted iterations
rank    [  70% ] 0028/1021 VUs  20.9s/30s  5000.00 iters/s
top     [  70% ] 0029/1019 VUs  20.9s/30s  5000.00 iters/s
write   [  70% ] 0114/0257 VUs  20.9s/30s  1000.00 iters/s

running (0m21.9s), 2330/2398 VUs, 231896 complete and 0 interrupted iterations
rank    [  73% ] 1075/1075 VUs  21.9s/30s  5000.00 iters/s
top     [  73% ] 1065/1066 VUs  21.9s/30s  5000.00 iters/s
write   [  73% ] 0190/0257 VUs  21.9s/30s  1000.00 iters/s

running (0m23.0s), 2748/2827 VUs, 234412 complete and 0 interrupted iterations
rank    [  77% ] 1201/1237 VUs  23.0s/30s  5000.00 iters/s
top     [  77% ] 1196/1248 VUs  23.0s/30s  5000.00 iters/s
write   [  77% ] 0337/0342 VUs  23.0s/30s  1000.00 iters/s

running (0m23.9s), 3503/3505 VUs, 235174 complete and 0 interrupted iterations
rank    [  80% ] 1526/1526 VUs  23.9s/30s  5000.00 iters/s
top     [  80% ] 1562/1562 VUs  23.9s/30s  5000.00 iters/s
write   [  80% ] 0417/0417 VUs  23.9s/30s  1000.00 iters/s

running (0m24.9s), 4133/4412 VUs, 237343 complete and 0 interrupted iterations
rank    [  83% ] 1781/1940 VUs  24.9s/30s  5000.00 iters/s
top     [  83% ] 1848/1966 VUs  24.9s/30s  5000.00 iters/s
write   [  83% ] 0505/0506 VUs  24.9s/30s  1000.00 iters/s
time="2026-09-16T16:22:06Z" level=warning msg="Insufficient VUs, reached 2000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=top
time="2026-09-16T16:22:06Z" level=warning msg="Insufficient VUs, reached 2000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=rank

running (0m25.9s), 4004/4579 VUs, 243153 complete and 0 interrupted iterations
rank    [  86% ] 2000/2000 VUs  25.9s/30s  5000.00 iters/s
top     [  86% ] 2000/2000 VUs  25.9s/30s  5000.00 iters/s
write   [  86% ] 0004/0579 VUs  25.9s/30s  1000.00 iters/s

running (0m26.9s), 4122/4579 VUs, 249016 complete and 0 interrupted iterations
rank    [  90% ] 2000/2000 VUs  26.9s/30s  5000.00 iters/s
top     [  90% ] 2000/2000 VUs  26.9s/30s  5000.00 iters/s
write   [  90% ] 0123/0579 VUs  26.9s/30s  1000.00 iters/s

running (0m27.9s), 4372/4579 VUs, 250932 complete and 0 interrupted iterations
rank    [  93% ] 2000/2000 VUs  28.0s/30s  5000.00 iters/s
top     [  93% ] 2000/2000 VUs  28.0s/30s  5000.00 iters/s
write   [  93% ] 0387/0579 VUs  28.0s/30s  1000.00 iters/s

running (0m28.9s), 4382/4652 VUs, 256079 complete and 0 interrupted iterations
rank    [  96% ] 2000/2000 VUs  28.9s/30s  5000.00 iters/s
top     [  96% ] 2000/2000 VUs  28.9s/30s  5000.00 iters/s
write   [  96% ] 0382/0652 VUs  28.9s/30s  1000.00 iters/s

running (0m29.9s), 4308/4652 VUs, 262606 complete and 0 interrupted iterations
rank    [ 100% ] 2000/2000 VUs  29.9s/30s  5000.00 iters/s
top     [ 100% ] 2000/2000 VUs  29.9s/30s  5000.00 iters/s
write   [ 100% ] 0308/0652 VUs  29.9s/30s  1000.00 iters/s

     ✓ score 200
     ✓ rank 200/404
     ✓ top 200

     checks.............................: 100.00% 267111 out of 267111
     data_received......................: 739 MB  24 MB/s
     data_sent..........................: 34 MB   1.1 MB/s
     dropped_iterations.................: 62893   2078.553999/s
     http_req_blocked...................: avg=227.68µs med=1.7µs   p(95)=9.16µs   p(99)=2.12ms   max=367.79ms
     http_req_connecting................: avg=215.24µs med=0s      p(95)=0s       p(99)=1.9ms    max=367.73ms
   ✗ http_req_duration..................: avg=147.83ms med=7.02ms  p(95)=910.28ms p(99)=1.75s    max=2.77s   
       { expected_response:true }.......: avg=147.83ms med=7.02ms  p(95)=910.28ms p(99)=1.75s    max=2.77s   
     ✗ { name:GET /leaderboard/rank }...: avg=152.03ms med=7ms     p(95)=939.52ms p(99)=1.97s    max=2.77s   
     ✗ { name:GET /leaderboard/top }....: avg=152.32ms med=6.77ms  p(95)=941.84ms p(99)=1.99s    max=2.77s   
     ✗ { name:POST /score }.............: avg=111.09ms med=8.9ms   p(95)=676.26ms p(99)=926.75ms max=1.26s   
   ✓ http_req_failed....................: 0.00%   0 out of 267111
     http_req_receiving.................: avg=45.42µs  med=12.45µs p(95)=107.83µs p(99)=429.44µs max=47.74ms 
     http_req_sending...................: avg=83.86µs  med=4.29µs  p(95)=119.6µs  p(99)=1.13ms   max=173.03ms
     http_req_tls_handshaking...........: avg=0s       med=0s      p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...................: avg=147.7ms  med=6.98ms  p(95)=909.68ms p(99)=1.75s    max=2.77s   
     http_reqs..........................: 267111  8827.765207/s
     iteration_duration.................: avg=148.19ms med=7.1ms   p(95)=912.35ms p(99)=1.76s    max=2.77s   
     iterations.........................: 267111  8827.765207/s
     vus................................: 4308    min=21               max=4382
     vus_max............................: 4652    min=1528             max=4652


running (0m30.3s), 0000/4652 VUs, 267111 complete and 0 interrupted iterations
rank  ✓ [ 100% ] 0000/2000 VUs  30s  5000.00 iters/s
top   ✓ [ 100% ] 0000/2000 VUs  30s  5000.00 iters/s
write ✓ [ 100% ] 0000/0652 VUs  30s  1000.00 iters/s
time="2026-09-16T16:22:11Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_duration{name:GET /leaderboard/rank}, http_req_duration{name:GET /leaderboard/top}, http_req_duration{name:POST /score}' have been crossed"